Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОНазначенииНаДолжность/KPI_ПриказОНазначенииНаДолжность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОНазначенииНаДолжность</name>
  <registerRecords>InformationRegister.KPI_ГрафикиРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.KPI_Квалификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.KPI_ГрафикиРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПользователяИБ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОНазначенииНаДолжность/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	KPI_ОбщегоНазначения.ПроверитьВозможностьИзмененияДаты(Объект.Сотрудники, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Проверка на задвоение вакантных должностей
	Для каждого Строка Из Объект.Сотрудники Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("СтруктураКомпании", Строка.СтруктураКомпании);
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Сообщить("Повторяющийся элемент в строке №" + Строка.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеНачисления(Команда)
	
	Если Объект.ПлановыеНачисления.Количество() Тогда 
		Если Вопрос("Текущие начисления будут удалены
			|Вы уверены?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПлановыеНачисленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеНачисленияНаСервере()
	
	Начисления = Справочники.KPI_Должности.ПлановыеНачисления(Объект.Сотрудники.Выгрузить());
	Объект.ПлановыеНачисления.Загрузить(Начисления);
	 	 
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеНачисленияСтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПредставлениеПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры
